[
  {
    "id": "1",
    "title": "Getting Started with Next.js",
    "description": "A beginner's guide to setting up your first Next.js application.",
    "coverImage": "https://picsum.photos/seed/nextjs/600/400",
    "content": "## Introduction\n\nNext.js is a popular React framework for building server-side rendered and static websites. This guide will walk you through the initial setup.\n\n### Prerequisites\n\n*   Node.js installed\n*   Basic understanding of React\n\n### Steps\n\n1.  Create a new Next.js app:\n    ```bash\n    npx create-next-app@latest my-next-app\n    ```\n2.  Navigate into your project directory:\n    ```bash\n    cd my-next-app\n    ```\n3.  Start the development server:\n    ```bash\n    npm run dev\n    ```\n\nYour app should now be running on `http://localhost:3000`.\n\nHappy coding!",
    "date": "2024-01-15T10:00:00Z",
    "category": "Web Development"
  },
  {
    "id": "2",
    "title": "Understanding React Hooks",
    "description": "Dive deep into useState, useEffect, and other essential React Hooks.",
    "coverImage": "https://picsum.photos/seed/reacthooks/600/400",
    "content": "## What are Hooks?\n\nHooks are functions that let you “hook into” React state and lifecycle features from function components. \n\n### `useState`\n\nThe `useState` hook allows you to add state to functional components.\n\n```javascript\nimport React, { useState } from 'react';\n\nfunction Counter() {\n  const [count, setCount] = useState(0);\n\n  return (\n    <div>\n      <p>You clicked {count} times</p>\n      <button onClick={() => setCount(count + 1)}>\n        Click me\n      </button>\n    </div>\n  );\n}\n```\n\n### `useEffect`\n\nThe `useEffect` hook lets you perform side effects in function components. It serves the same purpose as `componentDidMount`, `componentDidUpdate`, and `componentWillUnmount` in React classes, but unified into a single API.\n\n```javascript\nimport React, { useState, useEffect } from 'react';\n\nfunction Example() {\n  const [count, setCount] = useState(0);\n\n  // Similar to componentDidMount and componentDidUpdate:\n  useEffect(() => {\n    // Update the document title using the browser API\n    document.title = `You clicked ${count} times`;\n  }); // Add dependencies array [] to run only once\n\n  return (\n    <div>\n      <p>You clicked {count} times</p>\n      <button onClick={() => setCount(count + 1)}>\n        Click me\n      </button>\n    </div>\n  );\n}\n```\n\nExplore other hooks like `useContext`, `useReducer`, `useCallback`, `useMemo`, and `useRef` to manage complex state and optimizations.",
    "date": "2024-02-20T14:30:00Z",
    "category": "React"
  },
  {
    "id": "3",
    "title": "Styling in Modern Web Apps",
    "description": "Exploring different approaches like CSS Modules, Tailwind CSS, and Styled Components.",
    "coverImage": "https://picsum.photos/seed/css/600/400",
    "content": "## Styling Approaches\n\nChoosing the right styling strategy is crucial for maintainable and scalable web applications.\n\n### CSS Modules\n\nCSS Modules locally scope CSS by automatically creating unique class names. This prevents naming conflicts.\n\n```css\n/* styles.module.css */\n.title {\n  color: blue;\n}\n```\n```javascript\nimport styles from './styles.module.css';\n\nfunction MyComponent() {\n  return <h1 className={styles.title}>Hello World</h1>;\n}\n```\n\n### Tailwind CSS\n\nTailwind is a utility-first CSS framework that provides low-level utility classes to build designs directly in your markup.\n\n```html\n<h1 class=\"text-blue-500 text-2xl font-bold\">Hello World</h1>\n```\n\n### Styled Components\n\nStyled Components allow you to write actual CSS code to style your components using tagged template literals.\n\n```javascript\nimport styled from 'styled-components';\n\nconst Title = styled.h1`\n  font-size: 1.5em;\n  text-align: center;\n  color: palevioletred;\n`;\n\nfunction MyComponent() {\n  return <Title>Hello World</Title>;\n}\n```\n\nEach approach has its pros and cons. Choose the one that best fits your project needs and team preferences.",
    "date": "2024-03-10T09:00:00Z",
    "category": "CSS"
  },
  {
    "title": "hello",
    "description": "bye bye bye bye",
    "coverImage": "https://i.pinimg.com/736x/c2/93/31/c293312a3bbc7b5681ba2dad2db54db0.jpg",
    "category": "web development",
    "content": "15 Blogs We Love To Read\nA Cup of Jo\nIf you read blogs, you probably read A Cup of Jo. As the saying goes “come for the blog, stay for the comments” and that’s what everyone who reads Cup of Jo does. Some of our favorite articles ever have been from A Cup of Jo on topics ranging from relationships to parenting to travel. A Cup of Jo is one of our favorite blogs for weekly links and reads, tear jerkers, funny stories and practical tips for every part of life.\n\nMade by Carli\nFellow Rhode Islander Carli of Made by Carli is a DIY pro. Carli creates beautiful and inviting spaces and shares the process on her blog and Instagram. She’s currently working her way through her 1940s colonial fixer upper and the progress is so fun to watch. Check out what she’s done in the kitchen with a range hood DIY, and a gorgeous glass cabinet. She is great at taking you step by step through her process and her projects are easy to follow. If you love home renos and DIY projects definitely check out Made by Carli.\n\nThe Well Co\nThe Well Co by our friend Meg, based on Cape Cod, is a blog with tons of support and guidance for mothers. Meg provides a place for new and expecting moms to come together and feel less alone. Meg is a registered dietician nutritionist who created The Well Co to support mothers with everything from recipes to courses on nursing, pregnancy supplements and baby led weaning guides.\n\nThe Stripe\nThe Stripe is one of our favorite lifestyle blogs to read. Jess met Grace Atwood many years ago on a press trip, and has been following her blog and career ever since. We love Grace’s book recommendations along with her honest and incredibly thorough beauty product reviews. She also has great style finds and shares inspiring home decor, recipes and more. Don’t just take it from us though, Grace has a very loyal following with a large newsletter subscriber base and a huge Facebook Group!\n\nFresh Exchange\nIf you love gardening and cooking Fresh Exchange is a great follow. For 12 years, Megan Gilger has been using Fresh Exchange to help her readers navigate the seasons from garden to kitchen. Megan has a big focus on community which she fosters through her blog and online community platform where members can share their experiences and learn from Megan in the garden. You can find everything from recipes to gardening tips and DIY projects on her blog.\n\nAn Indigo Day\nAtlanta based blogger Jessica Camerata is the voice behind lifestyle blog An Indigo Day. She shares a ton of style content with lots of tips including her recent very popular series on updating your Millennial style. Jess also shares travel guides, life advice, beauty and hair content, home decor, and more. For those looking to get into the business of blogging, Jess also runs The Blog Societies.\n\nAlicia Tenise\nAlicia is an LA-based blogger (and now author), who covers everything from travel to fashion to wine. If you’re looking to plan your next trip she has great travel recommendations and she is exceptionally knowledgeable on all things wine having recently gone through WSET Certification. Don’t miss her wine and winery recommendations.\n\nJoJoTastic\nBased in the Pacific Northwest, Joanna is a former textile designer turned blogger. She shares amazing DIY projects, styling tips, and lots of reviews of underwear for her popular series, The Underwear Thesis. Joanna has a ton of interior content from her tiny home in Seattle and her now log cabin in the mountains.\n\nThis Time Tomorrow\nCome here for travel, history, fashion, architecture and stay for the gorgeous photography. This Time Tomorrow is Krystal Bick’s passion project that verges Parisian yesteryear with current day NYC living. Krystal shares her love of life’s small pleasures in order to help her readers “romanticize the big and small details of (their) own life that make it unique, that make it sing.” We loved her essay on The Death of Stills and Stillness.\n\nLindsay Silberman\nLindsay Silberman is a former magazine editor turned blogger and founder of Hotel Lobby Candle. On her blog, Lindsay shares luxur",
    "date": "2025-05-03T08:53:22.924Z",
    "id": "4"
  },
  {
    "title": "15 Blogs We Love To Read",
    "description": "Blogs are back! But were they ever really gone? For those of us who’ve always loved and read blogs, no, but we’ve noticed a recent focus on “going back to blogging” with more bloggers focusing on their own sites and more readers enjoying the content.",
    "coverImage": "https://www.k12digest.com/wp-content/uploads/2024/03/1-3.jpg",
    "category": "sample",
    "content": "<h1>hello</h1><p style=\"text-align: left\"><span style=\"color: #e03131\">sdfasfsadfsd</span></p>",
    "date": "2025-05-03T09:42:24.991Z",
    "id": "5"
  },
  {
    "title": "how to change cmd color",
    "description": "In this about how we change the change of terminal or cmd in windows using 1 step",
    "coverImage": "https://static.vecteezy.com/system/resources/thumbnails/024/307/842/original/hacking-concept-green-running-commands-on-the-computer-screen-video.jpg",
    "category": "Tech",
    "content": "<h1>How to change color in windows</h1><h3>Method 1: Temporary Change (Current Session Only)</h3><ol><li><p>Open CMD: Press <code class=\"bg-muted px-1 rounded-sm text-sm\">Win + S</code>, type <code class=\"bg-muted px-1 rounded-sm text-sm\">cmd</code>, and press Enter to open the Command Prompt.</p></li><li><p>Check Color Codes: Type <code class=\"bg-muted px-1 rounded-sm text-sm\">color /?</code> and press Enter to see the list of available colors. The codes are:</p></li><li><p>Change Color: Type <code class=\"bg-muted px-1 rounded-sm text-sm\">color XY</code> (replace X with the background color code and Y with the text color code). For example, <code class=\"bg-muted px-1 rounded-sm text-sm\">color 1F</code> sets a blue background with bright white text. Press Enter.</p></li></ol><p>Verify: The CMD window’s colors should change immediately. This change lasts only for the current session; closing CMD reverts to default colors.</p><h3>Method 2: Permanent Change (All Future Sessions)</h3><ol><li><p>Open CMD: Press <code class=\"bg-muted px-1 rounded-sm text-sm\">Win + S</code> type <code class=\"bg-muted px-1 rounded-sm text-sm\">cmd</code>, and press Enter to open the Command Prompt.</p></li><li><p>Access Properties: Right-click the title bar of the CMD window (where it says \"Command Prompt\") and select \"Properties.\"</p></li><li><p>Go to Colors Tab: In the Properties window, click the \"Colors\" tab.</p></li><li><p>Apply Changes: Click \"OK\" to save. This applies the colors to all future CMD sessions launched from the same shortcut.</p></li></ol>",
    "date": "2025-05-10T16:19:45.922Z",
    "id": "6"
  },
  {
    "title": "Consistency",
    "description": "Want to be more consistent towards my tasks its as good as  practice makes a man perfect.\n\n",
    "coverImage": "https://cruciformstuff.com/wp-content/uploads/2024/06/consistency.png",
    "category": "self-growth",
    "content": "<h1>What’s one small improvement you can make in your life?</h1><p>On this note I’ll be incorporating this small but crucial change into my ongoing life.</p><p>It has to be Aunt June. June was born in 1932 in London’s East End. Extended family lived all around her. She adored her two older brothers and followed them around everywhere, much to their annoyance. She grew up not intellectually gifted, but gifted in other ways; she was an artist, an excellent seamstress (she often made my clothes), and she knew how to bring out the best in people. She was a housewife/homemaker, and this was the career she was born to do. June’s house was a happy one; nobody every shouted or argued, like my mother and I did.</p><p><img class=\"max-w-full h-auto my-2 rounded\" src=\"https://adarshg0.wordpress.com/wp-content/uploads/2025/05/gemini_generated_image_f122ygf122ygf1228587747919837486880.jpeg?w=1024\">Every year Mum and Dad would send me to stay with Aunt June, Uncle Stan, and their two daughters for a week during the school summer holidays. June would sit with me and make glitter pictures, something my own mother never did as she was always at work. My cousins and I would rake over the dressing-up box in the shed and find clothes and high heeled shoes to parade about in, and June would take us out during the day to the seaside or the funfair (they lived only a few miles from the coast). I would hold her hand as we walked along, and she would squeeze my fingers and smile down at me. As a kid I wished I could live with June and Stan permanently.</p><p>As I grew older and had my own family, June and I would still ring each other at least once a week. Sam could always tell when June had rung, because I’d be laughing throughout the telephone conversation. When she was dying, she asked to see me one more time. I sat with her two weeks before she died and held her hand. I gave her fingers a squeeze, and she did the same to mine just like she did when I was a kid. We didn’t say much; we didn’t need to.</p><p>June died aged 79 in 2012, but I still think about her every day. Her funeral was the largest one I had ever seen. She was a people person; no degrees, no highbrow career as such, but just full of love for friends, neighbours and family.</p><p></p>",
    "date": "2025-05-13T08:39:03.670Z",
    "id": "7"
  },
  {
    "title": "Top 10 Indian Blogs to Read from Popular Indian Bloggers [2025 Special Edition]",
    "description": "Are you looking for the best Indian blogs to read? Curious to know the top bloggers from India? Your search ends here.",
    "coverImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSdReLeTDjSn6-KVDiVMd4KJ7bE9TPxn82_g&s",
    "category": "Information",
    "content": "<p></p><p>On this page, you’ll discover the top Indian blogs to follow in 2025. There are only two ways to succeed in blogging: reading and implementing.</p><p>If you’re not a regular reader of blogs and don’t know what’s going on around your niche, you can never create a successful blog that makes money.</p><p>Forget endless searching – we’ve handpicked a list of the BEST Indian blogs waiting to be explored. From tech gurus to culinary masters, there’s something for everyone. Let’s get started!</p><p>This list is a curated collection of some of the best blogs in India to read which keeps you inspired to blog better 🙂</p><p>Best Indian Bloggers To Follow In 2025 (Popular Blogs)</p><p>1. <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://Labnol.org\">Labnol.org</a>, Amit Agarwal</p><p><img class=\"max-w-full h-auto my-2 rounded\" src=\" https://bloggerspassion.com/wp-content/uploads/2019/10/Amit-Agarwal-blogger.webp\">There’s a reason we put Labnol #1 in this list of top blogs in India. The reason is the guy behind it: Amit Agarwal.</p><p>This famous blog was started by Amit Agarwal with a vision to spread the culture of blogging in India. Amit quit his job to become the first professional blogger from India.</p><p>Amit holds a degree from IIT, one of the most prestigious engineering institutions in India. He is also listed in the Adsense success story by Google. On this blog, Amit mostly covers tech-related topics, including How-to guides and solutions to tech issues.</p><p>Labnol is undoubtedly the best blogs in India where you can find technology simplified for you.</p><p>2. <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://YourStory.com\">YourStory.com, Shardha Sharma</a><img class=\"max-w-full h-auto my-2 rounded\" src=\"https://bloggerspassion.com/wp-content/uploads/2019/10/Shradha-Sharma-yourstory.webp\">Are you looking for inspiration and guidance in the startup world? Look no further than Yourstory, a leading Indian platform that mostly covers the journeys of successful entrepreneurs.</p><p>Founded by Shardha Sharma, YourStory showcases not only the latest business trends and startup stories but also emphasizes the power of women in leadership.</p><p>In a short time, YourStory has established itself as a valuable resource for the Indian startups, providing a mix of success stories, practical business advice, and more.</p><p></p>",
    "date": "2025-05-13T09:07:28.538Z",
    "id": "8"
  },
  {
    "title": "sample",
    "description": "sample hai bhai",
    "coverImage": "https://study.com/cimages/videopreview/random-sample-in-psychology-example-and-definition_111700.jpg",
    "category": "sample",
    "content": "<p>hello</p>",
    "date": "2025-05-13T09:53:02.403Z",
    "id": "9"
  }
]